Revit 2026 API

# EnergyAnalysisConstructionHeatTransferCoefficient Property

---

The heat transfer coefficient value (U-value) of the construction, in W/(m^2*K) (equivalent to kg/(k*s^3)).

**Namespace:** Autodesk.Revit.DB.Analysis**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public double HeatTransferCoefficient { get; }
```
```vb
Public ReadOnly Property HeatTransferCoefficient As Double
	Get
```
```cpp
public:
property double HeatTransferCoefficient {
	double get ();
}
```
```fsharp
member HeatTransferCoefficient : float with get
```

#### Property Value

Double

#### Reference

EnergyAnalysisConstruction Class

Autodesk.Revit.DB.Analysis Namespace